{"meta":{"title":"Wenew's Blog","subtitle":"","description":"","author":"wenew","url":"https://wenewenew.gitee.io/wenewenew","root":"/wenewenew/"},"pages":[{"title":"告示板","date":"2021-03-20T07:31:39.000Z","updated":"2021-09-24T07:09:58.418Z","comments":true,"path":"about/index.html","permalink":"https://wenewenew.gitee.io/wenewenew/about/index.html","excerpt":"","text":"建立初衷：此博客纯粹因个人兴趣（实际上就是脑子一热）而建立，现在准备随便写点东西，记录下生活，也给自己留个纪念。 版权说明：部分图片素材来源于网络，本博客所有文章除特别声明外，均采用CC BY-SA 4.0协议 ，转载请注明出处。 联系方式：↳哔哩哔哩&emsp; ↳Twitter&emsp;↳邮箱：&#119;&#101;&#110;&#x31;&#50;&#x33;&#50;&#x31;&#50;&#51;&#x40;&#103;&#109;&#x61;&#105;&#108;&#46;&#x63;&#x6f;&#x6d; 发展历程：↳博客正式建立：2021/3/23之前 ↳第一篇正式发表的文章：2021/4/17 ↳使用功能完善且配置方便的Hexo博客主题Fluid：? - 2021/8/19 ↳开始换用杂志报纸式简洁外观的Hexo主题Hipaper：2021/8/19"},{"title":"分类","date":"2021-08-19T04:19:38.000Z","updated":"2021-08-20T05:04:33.741Z","comments":false,"path":"categories/index.html","permalink":"https://wenewenew.gitee.io/wenewenew/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2021-08-19T04:16:49.000Z","updated":"2021-08-20T05:04:19.958Z","comments":false,"path":"tags/index.html","permalink":"https://wenewenew.gitee.io/wenewenew/tags/index.html","excerpt":"","text":""},{"title":"观看记录","date":"2021-10-25T13:06:17.620Z","updated":"2021-10-25T13:06:17.620Z","comments":true,"path":"video/index.html","permalink":"https://wenewenew.gitee.io/wenewenew/video/index.html","excerpt":"","text":"在这里我以表格的形式记录下我所观赏过的影视作品，并根据个人观看感受给出一个推荐值；“☆”指半颗星 作品名称 类型 推荐指数 备注 寻梦环游记 动画、音乐 ★★★★☆ 生命的终点站是忘却 大鱼 剧情、奇幻 ★★★★ If life is dry, let’s tell a story 龙猫 动画、治愈 ★★★★ 致记忆里的那份纯真 来自深渊 剧场总集篇 动画、冒险 ★★★★ 探索精神永存 楚门的世界 剧情、科幻 ★★★★ 每个人都会接受眼前的现实 Hello！树先生 剧情 ★★★☆ “活着没意思” 隐瞒之事 电影剪辑版 动画、治愈 ★★★★ 温暖的父女情 心灵奇旅 动画、音乐 ★★★★☆ 没人知道活着的意义是什么 叶问 动作、剧情 ★★★☆ 我要打十个！ 好久不见，武汉 人文、社会 ★★★★ 生命的力量 西虹市首富 喜剧 ★★★★ 如果有一天我变得很有钱 我不是药神 剧情、喜剧 ★★★★★ 我，不是药神 让子弹飞 喜剧、剧情 ★★★★★ 剧观百遍，其义自见 功夫 喜剧、动作 ★★★★☆ 一招从天而降的掌法 肖申克的救赎 剧情、犯罪 ★★★★ 时间太长，不知道要说啥了 阿甘正传 剧情、爱情 ★★★★☆ Run, Gump, Run! 放牛班的春天 剧情、音乐 ★★★★☆ 好老师值得尊敬 这个杀手不太冷 剧情、犯罪 ★★★☆ 身在黑暗，心向光明 夏洛特烦恼 喜剧、爱情 ★★★★☆ 马什么梅啊？ 太阳照常升起 剧情、奇幻 ★★★★☆ 我看不懂，但我大受震撼 疯狂原始人2 动画、冒险 ★★★★ 温馨的家庭关系 老师，好 剧情 ★★★☆ 高中时从老师那看的 无名之辈 剧情、喜剧 ★★★★ 小人物的故事 千与千寻 动画、奇幻 ★★★★★ 成长的童话 声之形 动画、爱情 ★★★☆ 校园欺凌要重视 天气之子 动画、爱情 ★★★★ 有你在就会晴天"}],"posts":[{"title":"MC联机方法及分析","slug":"MC的几种简单联机方法","date":"2021-10-28T06:49:54.000Z","updated":"2021-10-28T06:49:54.000Z","comments":false,"path":"2021/10/28/MC的几种简单联机方法/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/10/28/MC%E7%9A%84%E5%87%A0%E7%A7%8D%E7%AE%80%E5%8D%95%E8%81%94%E6%9C%BA%E6%96%B9%E6%B3%95/","excerpt":"本文将会给出几种MC联机的方法，当然，对某易版MC无效。一般来说只要人数不是太多都推荐基于局域网联机式的方案。","text":"本文将会给出几种MC联机的方法，当然，对某易版MC无效。一般来说只要人数不是太多都推荐基于局域网联机式的方案。 局域网式此方式限制同时在线游戏人数不多于8人，一般和好基友开黑来说也完全足够了。 Tip 如果两台电脑在同一局域网下（可理解为连接到同一路由器），则无需内网穿透也可以直接连接，延迟更低，稳定性更高。让对方输入“你的IP地址：端口号”即可连接（同样可以配合自定义局域网联机模组固定端口及关闭正版验证） 联机方案： 启动器（基于P2SP） 内网穿透（端口映射） 稳定性： 低 高 便捷性： 简便 一般 延迟： 高（有时有较明显卡顿） 低（丝滑） 其他要求： 游戏时双方均需保持启动器运行 需要实名认证，支付宝以及¥1 利用启动器联机比较方便，但就目前来看十分不稳定，主流的PCL2和HMCL启动器近期都提供了测试阶段的联机功能，其优势在于便捷，但缺点也很明显，从我一段时间的使用来看可谓十分难受，并且对网络状况也有要求，如果你刚好使用校园网的话，基本不用考虑这种方案了。 下面以PCL2进行联机教程，基本原理大差不差，HMCL操作起来也很相似。 联机时建议配合自定义局域网联机模组用于固定端口以及跳过正版验证。下面是一个大体流程： 进入游戏，打开存档，对局域网开放，（关闭在线模式选项）； 点击创建房间并按提示输入端口，如果你加了上面的联机模组，输入默认的端口（25565）即可； 每台设备会有一个固定的链接码，点击“建立连接”，输入基友的链接码，或复制你的链接码让好基友进行建立链接操作即可； 最后，点击房间列表里的房间可以复制链接地址，让对方在多人游戏中输入链接地址即可加入你的世界。 利用端口映射联机此方案是现阶段个人较为推荐的一种方法，连接较为稳定且延迟挺低的，原理是通过端口映射将内网端口映射到公网，其他人就可以访问了。推荐使用的平台为SAKURA FRP，进行实名认证时需要一块大洋，流量通过每天签到也绝对够用了（就是不要钱）。同样推荐使用自定义局域网联机模组用于固定端口以及跳过正版验证。 进行端口映射的流程： 首先前往SAKURA FRP网站注册一个账号并完成实名认证； 下载映射软件并安装，推荐的那个即可； 从管理面板复制访问秘钥以登录桌面程序（刚刚安装的映射软件）； 查看本机IP，Win+R运行，输入cmd，回车，在cmd界面输入ipconfig/all，回车，找到IPV4后面的地址复制下来； 从映射程序创建新隧道，按下图输入即可，可以进行延迟测试选择延迟最低的服务器，隧道类型TCP，强烈建议配合联机模组固定端口，保持25565即可，以后打开软件即可直接映射端口； 现在，确保刚刚建立的端口为打开状态进入游戏并对局域网开放（需要端口和上一步相同，故建议使用联机模组并保持使用默认的25565） 将你得到的连接地址发给好基友，对方在多人游戏使用此链接进行连接即可，此链接一般来说不会再变更。 服务器式通过部署服务器来实现多人在线游戏，优势在于只要开着服务器，别人随时都可以进，即使你退了游戏也不受影响；同时也可以使用适用于服务器的插件（在支持的情况下），可以做到很多人同时在线但是对性能要求也较高，一般来说并不推荐这种方式，故只简单的说下大概，同时这里只介绍Windows个人电脑开服务器来实现联机游戏的方式。 Tip 你知道吗？除了基于java版服务端，MC官方也给出了基岩版MC的服务端程序，目前还处于测试阶段，可以从这里下载，不过玩基岩版的应该不多，下面就不再探究了。 选择服务端MC服务端真的是十分复杂，除了官方提供的（从正版启动器添加版本时可以找到各个版本的服务端下载链接）外，还有各种可以运行模组，插件的服务端。我对此了解不多，可以参考这篇文章：各种Minecraft服务端介绍和下载地址 进行配置首先主要是修改server.properties内的各项设置，调节内存分配等。之后还要进行端口映射（可以参考上面利用端口映射联机部分提及的方法。 就到这里，这篇文章着重介绍了基于局域网联机和好友愉快游戏的方法，一个人玩MC感到孤独的话，不妨找个大聪明的网友一起来，我认为MC在多人游戏下会有更多的乐趣。","categories":[{"name":"技术分享","slug":"技术分享","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E6%8A%80%E6%9C%AF%E5%88%86%E4%BA%AB/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E6%95%99%E7%A8%8B/"},{"name":"MC","slug":"MC","permalink":"https://wenewenew.gitee.io/wenewenew/tags/MC/"}]},{"title":"MC优化模组使用推荐","slug":"MC优化模组使用推荐","date":"2021-09-25T07:14:47.000Z","updated":"2021-09-25T07:14:47.000Z","comments":false,"path":"2021/09/25/MC优化模组使用推荐/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/09/25/MC%E4%BC%98%E5%8C%96%E6%A8%A1%E7%BB%84%E4%BD%BF%E7%94%A8%E6%8E%A8%E8%8D%90/","excerpt":"我一直都挺关注MC优化类模组的，包括之前做整合包的时候也是四处寻找各类优化模组，还是积累下来不少经验的，这篇文章主要会分享下我对优化模组的见解并给出一些推荐搭配。","text":"我一直都挺关注MC优化类模组的，包括之前做整合包的时候也是四处寻找各类优化模组，还是积累下来不少经验的，这篇文章主要会分享下我对优化模组的见解并给出一些推荐搭配。 Before Forge和Fabric是两种不同且互不兼容的模组加载器，&gt;1.16版本推荐优先考虑Fabric 为方便访问，下面均链接至MC百科，请到百科相关链接找下载地址，有modrinth链接可以优先选择 为尽量减少和其它模组冲突的意外状况，与过多模组冲突或早已不再维护的模组不会进行推荐 篇幅有限，不可能说的面面俱到，我还是会备注一些重要内容，详情点击通往百科的链接即可 推荐列表：方案里会尽可能多的推荐优化模组，使用时根据游戏版本，有些模组可能不支持部分游戏版本，请自行点击链接到MC百科查看支持情况，若不支持，忽略此模组即可。 Forge： 高清修复-Optifine：大名鼎鼎，几乎覆盖了所有的MC版本 泡沫修复-FoamFix：帮助减少游戏内存占用 磷-Phosphor：光照机制优 星光-Starlight：相比于磷是更进一步，效果更好，兼容性略差一些，请二选一 更好的FPS-BetterFPS：一般来说请选择riven的一半算法，否则可能负优化 锂-Lithium：致力于在不修改原版游戏内容的前提下做出更多的优化改进 粒子渲染机制优化-Particle Culling(1.12.2)/粒子渲染机制优化-Cull Particles：顾名思义 实体渲染机制优化-Entity Culling/实体渲染机制优化-Entity Culling Fabric/Forge：同上 Fabric： Info Fabric下不推荐OptiFabric+Optifine的选择，需要光影请选择Iris，如果你需要的是Optifine的其他功能，请往下翻，下面会给出Optinfine其他实用小功能的替代方案。 钠-Sodium：提供强力优化，FPS拯救者 Iris Shaders：光影的新选择，可以秒切光影；内置钠模组，请不要再单独加钠模组 流畅加载-Smooth Boot：对于多线程CPU可以显著减少加载耗时 锂-Lithium：致力于在不修改原版游戏内容的前提下做出更多的优化改进 氢-Hydrogen：相比于锂是更加激进的优化，二选一即可 C^2M 引擎-C^2M-Engine：提高区块的性能，官方推荐搭配锂和磷（最佳稳定性的好选择） 磷-Phosphor：光照机制优化 星光-Starlight：相比于磷是更进一步，效果更好，兼容性略差一些，请二选一 铁氧体磁芯-FerriteCore：以另一些不同方式减少内存占用 实体渲染机制优化-Entity Culling Fabric/Forge：如名 ！方块实体优化-Enhanced Block Entities：对一大堆箱子的情况格外有效，和钠冲突，但也有解决方案 Tip 在Fabric下不使用OptiFabric而使用其它模组还原出Optifine的各种功能：钠(不要光影)/Iris(有光影需求)+更好的钠视频设置按钮+更好的草方块+动态光源+C键放大+（连接材质&amp;铟） BB几句：如果你电脑很好，优化模组可以锦上添花，几百帧完全不是梦；如果你对电脑不是很好，优化模组对你将会是很大帮助，借此你可以更流畅地游玩更多模组；如果你的电脑很差，那优化模组或许能将你从电竞水平拉到能玩(doge) 好了，现在你已经准备好了优化模组，可以流畅的…游玩原版了（bushi 如果你想深入研究，这只是个开始，加了这些模组甚至不能称作一个底包，因为还缺少大量辅助模组，辅助模组的话要说起来只会更加复杂，也许以后有机会搞一下推荐。把一切准备就绪，你就可以加入有实际内容的模组了。 有时候优化模组堆积太多也未必就是好事，正正得负也是有可能的。说了这么多，其实主要还是针对新版本，特别是进入1.17世界高度提提升，麻将的优化却做的远远不够。旧版本的话加个Optifine就完全没问题。","categories":[{"name":"技术分享","slug":"技术分享","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E6%8A%80%E6%9C%AF%E5%88%86%E4%BA%AB/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E6%95%99%E7%A8%8B/"},{"name":"MC","slug":"MC","permalink":"https://wenewenew.gitee.io/wenewenew/tags/MC/"}]},{"title":"2020-2021年度追番小结","slug":"年度看番小结","date":"2021-09-15T10:16:09.000Z","updated":"2021-09-15T10:16:09.000Z","comments":false,"path":"2021/09/15/年度看番小结/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/09/15/%E5%B9%B4%E5%BA%A6%E7%9C%8B%E7%95%AA%E5%B0%8F%E7%BB%93/","excerpt":"大概从去年暑假开始我正式开始追番，大概率是因为无聊吧，然后到目前看了大概有五六十部吧，我把看番当成了一种休闲活动，从开始的懵懂到逐渐看出了一些门道，毕竟在这方面花费了这么长时间，我决定就目前看过的番剧做一下总结，并且这可能会成为一个每年一更的保留节目。","text":"大概从去年暑假开始我正式开始追番，大概率是因为无聊吧，然后到目前看了大概有五六十部吧，我把看番当成了一种休闲活动，从开始的懵懂到逐渐看出了一些门道，毕竟在这方面花费了这么长时间，我决定就目前看过的番剧做一下总结，并且这可能会成为一个每年一更的保留节目。 Info 我这里的”番剧“将会是一个较为宽泛的概念，可能包括大多动画作品，具体界限有我自己决定。 Top 10就现阶段看过的番里面，我列出个人最推荐的十个。 作品名称 类型 推荐值 奇巧计程车 (ODD TAXI) 原创、剧情、悬疑 ★★★★★ 日常 搞笑、日常 ★★★★★ 为美好的世界献上祝福！ 穿越、奇幻、搞笑 ★★★★☆ 小林家的龙女仆 日常、萌系 ★★★★☆ 魔法少女小圆 原创、魔法、惊悚 ★★★★☆ Fate/Zero 奇幻、战斗 ★★★★ 魔女之旅 魔法、奇幻 ★★★★ 珈百璃的堕落 日常、神魔 ★★★★ 街角魔族 萌系、搞笑 ★★★★ 爱，死亡和机器人（Love, Death &amp; Robots） 原创、科幻、奇幻 ★★★★ 偏好分析这一年来我看的番大多都是评分或人气较高的作品，有以前的经典，有比较近的优秀作品，虽说目前看过番不多，但我看番大概有以下特点： 对日常题材的偏好我认为日常、萌系、搞笑这种元素的番很合我胃口，要说原因，就是轻松，这些作品有一种特殊的魅力，能让你在一段时间的疲惫之后放松下来，由于这些作品大多没有明确的故事发展，每集可能都是某个生活中的小片段，你不用过多的去思考剧情或是复杂的人物关系 ，而是专注在人物本身和叙事上，感受日常生活的温暖与欢乐。 对各类作品的尝试我有时会找一些对我来说比较新奇，平常接触较少类型的番，虽说对日常向作品有所偏好，但是我还是很希望多去看一些不同类型的作品。这会带给我非常不同的感受。比如我放在第一位的ODD TAXI，能够看到这种作品很不容易，应该说能够看到这种作品我很幸运。 回到起点Hey，我是怎么开始追番之路的呢？因为某UP主固定一个奇妙开头，好奇心驱使便去找了出处，其来自《恋爱研究所》的一个名场面，然后闲着无聊看完了，嗯，这也算是我第一次追番，在此前我甚至对这些连最基本的概念都没有。然后自此，一扇神奇的大门打开了… 一路感触先说说番剧对我的影响，番剧其实很大的影响了我的生态度，尤其是一些日常作品，在我低落时期带给了我很多的欢乐，甚至说重燃了我对生活的期待也不为过，能有机会接触这些优秀的动画作品是我的幸运。 在追番上，从最初的不知道看神魔，到现在我想观看的列表比已观看还要长，很多感兴趣的作品还没来得及去看，反正慢慢来呗，我认为看番是要看心情的，也许在心情不好时，一部温馨的日常番可以带给你莫大的安慰，而有时，一部热血的番可以让你重燃信心。 一些争议，我的追番之路也是我接触二次元的过程，“二次元”这个词存在很大的争议，在生活中这个词往往被作为一个形容词（甚至是偏向贬义），而根据百科“二次元”是一种类型的文化，而非一种风格。真的是非常奇怪，甚至有时候有人会因“动漫”和“动画”两个词吵得不可开交，不过我并不在意，你只要别影响我看番就行（doge） 我希望看到番剧或能够带给我一些感动，或能给我一些感触，或能引发我一番思考，或是博我一笑，给我一份温暖。我更希望去看一些打破常规套路的番，给观众带来更多新鲜感，给动画作品更多可能。 结束了？今年份的总结就到这了，说实话字数有点少，倒也无所谓了，反正说多了都是累，本来这个月想整篇比较特殊的文章，结果月初都在忙着练车，没时间整素材，昨天刚过科二，之后还得补一下漏掉的网课，正好之前有看番总结的想法，便用几个小时整出了这篇文章，不说了，先滚去学习了。","categories":[{"name":"年更节目","slug":"年更节目","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E5%B9%B4%E6%9B%B4%E8%8A%82%E7%9B%AE/"}],"tags":[{"name":"小结","slug":"小结","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E5%B0%8F%E7%BB%93/"},{"name":"番剧","slug":"番剧","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E7%95%AA%E5%89%A7/"}]},{"title":"对于博客建设的总结与思考","slug":"about-blog","date":"2021-08-19T10:44:37.000Z","updated":"2021-08-19T10:44:37.000Z","comments":true,"path":"2021/08/19/about-blog/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/08/19/about-blog/","excerpt":"如果你正打算建一个个人博客的话，我劝你耗子尾汁(doge)，如果你只是满足一下自己的好奇心，那么现在可以立刻马上放弃，在现在这个时代，能愿意拿出时间来看你胡言乱语的人少之又少（我又在自己骂自己了），这也是我将我的个人博客定义为“开放且无人翻看的日记本”的一部分原因。如果你依然坚持那么往下看：","text":"如果你正打算建一个个人博客的话，我劝你耗子尾汁(doge)，如果你只是满足一下自己的好奇心，那么现在可以立刻马上放弃，在现在这个时代，能愿意拿出时间来看你胡言乱语的人少之又少（我又在自己骂自己了），这也是我将我的个人博客定义为“开放且无人翻看的日记本”的一部分原因。如果你依然坚持那么往下看： Warning 本人技术小白一只，专业不是计算机，以下全部只针对于基于Hexo的静态博客，并且这也不是一篇技术类文章，不过如果你是第一次接触个人博客的话，或许对你有所帮助。 起因我也忘了当初是因为什么来建博客的了，一般来说，我们日常生活中是很少能接触到个人博客这种东西的。不过最后我还是弄了出来，现在想来属实是一段神奇的经历。 即便对着教程，看着视频来按部就班地来也会出现一些意料之外的问题，对我这种没有任何相关知识储备的人来说会造成极大影响，这也是为什么我第一次尝试时以失败告终。不过在那之后一段时间比较清闲的时候我再一次挑战建立博客，而这次成功了。 过程第一次的成功多半在于主题的选择，在尝试了一些主题后无意间发现的Fluid主题提供了非常完善的中文使用说明和问题解答，帮我解决了不少问题，有了之前的经历也才有了最近更换主题的快速成功。 既然建好了就要考虑拿来做什么了，其实在第一次开放之前我就写了几篇文章了，只是后来偷偷删掉了，再然后嘛就是比较正常的写文章、大概每个月会写一篇吧，主要还是看我心情和空闲时间是否充足，大概就是记录生活啥的（顺便一句题外话，我准备考科目二的时候考试在之前两天取消了，因为疫情，F**k。）。其实后来慢慢的我发现博客这东西挺合我胃口的，鄙人不善于言辞，就平时朋友圈、QQ动态从不发东西，而个人博客提供了一个很好的平台，可以让我不加遮掩地输出我的一些思考和想法。 虽然说这完全不是技术、教程类文章，但我还是想总结一下建立博客的总体思路： Progress ↳做好准备工作、可以去找视频教程根据说明准备好需要的软件条件 ↳确定建立的平台、基于Gitee还是Github（在国内不太稳定）或是其他我就不知道了 ↳开始建立过程，建议找个图文教程参考一下，最好是时间比较近的 ↳个性化你的博客，这个完全取决于自己，一般是使用主题配合一些插件 ↳最后，写博客，可能需要用到一些语法，不过你最好知道自己要写什么 感想对于Hexo博客的认知： 优势：部署方便、流程简单、对技术要求不高 缺陷：不能动态更新，所以有时候需要刷新才能看到新内容 对于博客流量的看法： 我之前其实尝试过做一些宣传的，不过意义并不大，现在对此就非常的佛系了 对于今后的一些想法： 现在此博客对我来说更像是我的个人空间，一个避风港，表达出我想要的东西，我认为这就足够了，今后会尽量坚持下去的。","categories":[{"name":"经验之谈","slug":"经验之谈","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E7%BB%8F%E9%AA%8C%E4%B9%8B%E8%B0%88/"}],"tags":[{"name":"小结","slug":"小结","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E5%B0%8F%E7%BB%93/"},{"name":"闲谈","slug":"闲谈","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E9%97%B2%E8%B0%88/"}]},{"title":"有关MC原生类整合包制作的小感","slug":"suiyi03","date":"2021-08-09T08:52:00.000Z","updated":"2021-08-09T08:52:00.000Z","comments":true,"path":"2021/08/09/suiyi03/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/08/09/suiyi03/","excerpt":"这并不是一篇技术类文章，而是以我制作原生类整合包过程之中和之后的感想为主 貌似上个月没有更新文章诶，主要是没啥想写的，正经人的生活就是那么的无趣。我当时甚至打算关掉博客，这些文章肯定会成为黑历史，不过后来一想还是留着吧（主要是考虑到没人看），就让这些文章留在这里吧，毕竟此博客建立的初衷就是记录生活，记录改变，这些文章反而正式我所需要的，而需要改变的是我对待博客态度，这个博客更像是一个开放但没人翻看的日记本，记录我各种想法，五味陈杂，我要做的就是写出有意思的或自己感兴趣的东西上传，而不是每月逼自己写一篇文章。","text":"这并不是一篇技术类文章，而是以我制作原生类整合包过程之中和之后的感想为主 貌似上个月没有更新文章诶，主要是没啥想写的，正经人的生活就是那么的无趣。我当时甚至打算关掉博客，这些文章肯定会成为黑历史，不过后来一想还是留着吧（主要是考虑到没人看），就让这些文章留在这里吧，毕竟此博客建立的初衷就是记录生活，记录改变，这些文章反而正式我所需要的，而需要改变的是我对待博客态度，这个博客更像是一个开放但没人翻看的日记本，记录我各种想法，五味陈杂，我要做的就是写出有意思的或自己感兴趣的东西上传，而不是每月逼自己写一篇文章。 背景说明怎么会想到去做一个整合包的呢？ 额，一时还很难回答，可能更多是觉得有趣吧，还有就是我平常喜欢翻看一些模组的介绍，就想着做一个整合包尽可能的包含我想要的模组，然后我最初入坑模组也是从一个不知名的整合包开始的，算是一些情怀吧。 你的整合包里呢？什么类型的？ MediaFire（总下载链接，下面均链接至发布贴，有度盘链接和详细介绍） 理想世界整合：基于1.12.2Forge打造（对，就是那个模组最多的1.12.2），是第一个，也是投入最多心思，最符合制作整合包最初目的的一个。可休闲、可冒险、可以被虐。 归零整合：游戏版本1.16.5，更多是基于对Fabric的喜爱而制作，壮哉我大Fabric！比较单纯，难度不大，适合养老，优化很好的整合包。 归零整合Plus：尝试向归零整合中加入更多的冒险元素以增强游戏难度和可玩性，但是在这方面Fabric属实让人失望，帖子还被回收了，在第一个版本后便不了了之，下载惨淡，说出来都是泪。 之后呢？还会去尝试更有挑战性的内容吗？ 不会，现有整合包也已全部停止更新，不过有问题的话还是会尽力帮大家解决。主要是个人能力还差得远，而且这东西前几个月里占用我太多时间了。 制作过程制作前有一堆的事情要做，首先要了解整合包制作大概过程，在此阶段我曾翻阅了大量教程，最初我曾打算做一个魔改整合，奈何难度太大并且要付出的时间太多便直入原生整合包，这类整合其实制作非常简单，因此也催生出了一大堆非常低质量的原生整合，不过我的整合包还是很有特色的，也是费了不少心血的。 就以最早的理想整合为例，我清晰的记得当时一个个精挑细选模组的情形，在选取模组时进行了很多的调整，当时把MC百科里的1.12.2的模组翻了一遍，最后选出了一些我想加进去的。然后，实装模组并测试，这个过程也是问题不断，一些模组会有冲突，甚至和一些优化模组产生奇怪的问题，解决冲突很大概率是通过删除模组实现来实现，而这样又要考虑游戏平衡性，删掉的是什么模组？功能是什么？能不能找到替代的模组，然后还要再测试。之后最痛苦的应该就是实际生存模式下测试了，这过程中会肉眼可见一些奇怪的问题，有些可以修改模组设置来解决，有些则不能。之后就是进行简单但很烦的模组配置文件修改，在这个整合中我进最大可能修改了模组配置，以达到我想要的效果。当时搞这东西疯狂到甚至在宿舍熄灯后我还在查相关资料或是一遍又一遍启动游戏进行测试。 此外，制作最初就选用了PCL2启动器，可能主要是平时用的比较多吧，个人认为其操作逻辑要比HMCL合理。我甚至学习了如何配置PCL主页，如下面的效果（制作归零整合时还自定义了帮助文件，将其整合到了启动器内）。 还有就是制作中做了很多小工作，比如一个附加的材质包，一份更新日志，一个模组指南，我不知道有多大的意义，但是当时就是这么做了，就不在细说了。 制作之后在做完了整合包之后我还花费了不少心思调整平衡性，修复BUG，优化游戏体验等一系列操作。关于BUG的修复，实在让我胃疼，虽然不少人下载了，但完全不会给出建设性反馈，帖子收到回复大概是2%的概率（其中大多数还是灌水的），大多数都是白嫖党（就像平时的我一样），基本全靠我自行开生存玩游戏实际体验，所以只会注意到我发现的问题进行修复，挺难受的。 在之后就是一些总结和思考了，我打算不再这方面花费时间，而做完整合包后很长一段时间都没有打开MC，属实是看到游戏界面就想吐的那种感觉。不过制作整合包的过程中自己还是有学到挺多东西的，那段时间属实为我留下了深刻印象。","categories":[{"name":"经验之谈","slug":"经验之谈","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E7%BB%8F%E9%AA%8C%E4%B9%8B%E8%B0%88/"}],"tags":[{"name":"闲谈","slug":"闲谈","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E9%97%B2%E8%B0%88/"},{"name":"MC","slug":"MC","permalink":"https://wenewenew.gitee.io/wenewenew/tags/MC/"}]},{"title":"也许我们不需要思考明天会怎样","slug":"suiyizhitan2","date":"2021-06-28T14:40:00.000Z","updated":"2021-06-28T14:40:00.000Z","comments":false,"path":"2021/06/28/suiyizhitan2/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/06/28/suiyizhitan2/","excerpt":"这篇很多内容是一时起意所写，不再修改，可以理解为赶一篇文章吧，反正就是在胡扯。 时光匆匆 燕子去了，有再来的时候；杨柳枯了，有再青的时候；桃花谢了，有再开的时 候。但是，聪明的，你告诉我，我们的日子为什么一去不复返呢？ 上面那句源自朱自清散文《匆匆》，上过学的你一定有印象，时间不会停留。前几天突然发现初三那年办理的身份证就要过期，是啊，五年了呀，弹指一挥间，看着身份证上稚嫩的脸庞，不仅会回想起过去那段时光，不明事理地过着简单而又纯粹的日子。","text":"这篇很多内容是一时起意所写，不再修改，可以理解为赶一篇文章吧，反正就是在胡扯。 时光匆匆 燕子去了，有再来的时候；杨柳枯了，有再青的时候；桃花谢了，有再开的时 候。但是，聪明的，你告诉我，我们的日子为什么一去不复返呢？ 上面那句源自朱自清散文《匆匆》，上过学的你一定有印象，时间不会停留。前几天突然发现初三那年办理的身份证就要过期，是啊，五年了呀，弹指一挥间，看着身份证上稚嫩的脸庞，不仅会回想起过去那段时光，不明事理地过着简单而又纯粹的日子。到现在，日子一天又一天走着。清闲时，我会觉得无聊，自己像是废人，整天带着神志不清的大脑，睁眼-玩手机-吃饭-打电动-吃饭-玩手机-睡觉-…这样重复而枯燥的生活；当自己真的比较忙，时间依然显得这么快，去上两节课，半天没了，搞点东西，一看时间，啊，这么晚了。当然，以上是颓废的我自己，想想也是，但是有时候就是完全提不起兴趣，道理都懂，但身体很诚实。 理想来说，我差不多走了人生的1/5了，想一想，也许人生并没有我们想象中那么久。 未来茫茫选择，生活中到处都是，有时候我不仅会思考，如果当初选择了其他的道路，现在的生活会是什么样子？选择总是大于努力，很不幸，生活中的选择不存在标准答案，每个人都有不同的人生，有些事也不是我们可以选择。 期待，谁不希望自己一觉醒来变成亿万富翁呢。平心而论，我对自己有很多期待，以前还曾想着长大后要干一番大事业来着。我小时候算是别人口中的好学生，尤其是小学，小学时除了学习我似乎什么都没学到，不会与人交往，不懂得表达自己，等等，反正就是一老实的好学生；初中，第一次离开村子，离开家，到当地小县城去上学，想起当时那年我是很幸运的，甚至连考试都没有，只有一个小面试，在初中我的情商也基本是小学水平；到了高中，我了换了学校，没有上初中的高中部，这多亏了母亲的坚持，相比于之前，这里自由许多，甚至周日给一个下午自由时间，这是很多学校都不会出现的，学校更加强调自主，更依赖自己，高中几乎是我的启蒙时代，我开始对各种事件有了自己的看法，同时交到了很可能是这辈子感情最深的室友们。 一不小心，都快成回忆录了，那么这和“期待”有什么关系？当然有，在小学和初中，我像是莫得感情的机器，我的一切，几乎都被父母包办，我努力活成他们想要的样子，全力满足他们的期待，好好学习，遵守各种规章制度，这可能也是造成我如偏内向性格的一大原因。到高中，我开始争取自主，可以称为“叛逆期”吧，遇到他们啰嗦的各种关心，我表现出极大的不耐烦，并且对学习有了新的认知，这大概率是认知的改变，我，接触了网络，接触了各种观点，这个时期我对一切都持有质疑态度，不再相信权威，也会有些小小的自傲感，也开始做一些从未想过的大胆的事，当时还会思考未来，对前途一片迷茫。现在的我，在大学里像是浑天度日，想着人生大概率也是在平平凡凡中度过。 我们看不到未来，没人知道海的对面是什么，不过，也许可以做些什么来给未来更多可能。 前路漫漫今天离开学校那刻，突然意识到自己已经度过了近一年的大学时光了，一年了，我不禁问自己在这一年的时光里我做了些什么？除了娱乐之外，我似乎没有任何能说的出来的成就。 曾经立下一地的Flag，如今，它们依然安在，当你想起它们，它们指着你说：“loser”。人生并不算长，我们深知；明天不多，我们清楚；现在就走，我们应当，可我做不到。我本人从未做到坚持一件事并做出结果，我深知如此，不过，还是不能就此停止， 在逃去如飞的日子里，在千门万户的世界里的我能做些什么呢？只有徘徊罢了，只有匆匆罢了；在八千多日的匆匆里，除徘徊外，又剩些什么呢？过去的日子如轻烟，被微风吹散了，如薄雾，被初阳蒸融了；我留着些什么痕迹呢？我何曾留着像游丝样的痕迹呢？我赤裸裸来到这世界，转眼间也将赤裸裸的回去罢？但不能平的，为什么偏要白白走这一遭啊？ 既来之，则安之，做不到的事情，还是要尝试，就像那句“我一定会回来的！”希望下次，我可以坚定地告诉你们最近一段时间取得的进步！","categories":[{"name":"胡思乱想","slug":"胡思乱想","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E8%83%A1%E6%80%9D%E4%B9%B1%E6%83%B3/"}],"tags":[{"name":"闲谈","slug":"闲谈","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E9%97%B2%E8%B0%88/"}]},{"title":"-最近在干吗？-每日摸鱼(1/∞)。","slug":"suiyizhitan01","date":"2021-05-19T04:06:22.000Z","updated":"2021-05-29T00:45:00.000Z","comments":false,"path":"2021/05/19/suiyizhitan01/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/05/19/suiyizhitan01/","excerpt":"时间真快啊，特喵的五月就快结束了！ 哈哈，我没有eat salt，我说过会把这个博客坚持下去，至少五月的文章水出来了。最近有点水，上课划水严重，但是也做了些有趣的事，也不是很闲吧（重新定义什么算闲doge）。桥豆麻袋，让我先回忆一下最近做了啥。嗯…啊…额…，想不起来了，那么就写到这里，有缘再见（手动划掉）。 洞洞腰任务：第一篇文章不是那个杂乱无章的任务吗，我都完成了啥子嘞，《黑暗森林》已经读完（自豪），第三部打算无限咕咕咕下去（其实是要准备各种考试了，下周开始还要实训，啊，我的四级，真的能过吗？）；然后，单词，其实之前还在坚持去背的，最近就……，前段时间做了个模拟卷，很明显重点应该放在听力上，多练练，然后背一下核心单词，嗯，暂时这样。","text":"时间真快啊，特喵的五月就快结束了！ 哈哈，我没有eat salt，我说过会把这个博客坚持下去，至少五月的文章水出来了。最近有点水，上课划水严重，但是也做了些有趣的事，也不是很闲吧（重新定义什么算闲doge）。桥豆麻袋，让我先回忆一下最近做了啥。嗯…啊…额…，想不起来了，那么就写到这里，有缘再见（手动划掉）。 洞洞腰任务：第一篇文章不是那个杂乱无章的任务吗，我都完成了啥子嘞，《黑暗森林》已经读完（自豪），第三部打算无限咕咕咕下去（其实是要准备各种考试了，下周开始还要实训，啊，我的四级，真的能过吗？）；然后，单词，其实之前还在坚持去背的，最近就……，前段时间做了个模拟卷，很明显重点应该放在听力上，多练练，然后背一下核心单词，嗯，暂时这样。 No.吐前段时间翻MC百科比较多，好吧，了解了很多Mod，但是大多都不怎么会玩，然后脑子再次一热（这不怪我）准备做一个MC的整合包，然后发现实力不够，不过还是草草完成了一个最初版（已更新，现在这里是0.3.1正式版，也是最终版了，不过历史版本也留了。）留个链接，（神秘代码：y3d8）。还是费了很大心思的，不过效果并不好，主要是不舍得删模组吧，最后有点卡卡的感觉 [你好逊哦，经过我一番修整后，0.2.4已经非常稳定了！]自此，计划暂时搁置下去，呜呜呜（太弱小了，没有力量！） 弟山条其实前段主要的空闲时间都在看番喽，游戏也有一点，不过我现在玩游戏真的很少（魔幻的世界啊），看番是个费时间的东西，主要是我一般不会倍速，我看番纯粹是为了放松（-那熬夜来看也是放松吗doge? -那只是偶尔有点入迷了，真的！） 然后，最近有在认真学习的，一直在看高数（其实也挺简单的，至少看起来是这样），至少不要补考吧，加油加油！未来依然可期！ 琐事条自问自答系列：（Q：question；R：reply） Q：写博客的目的是什么？ R：主要是想留个纪念，追求一种满足感？，不过对我总结和逻辑还是有很大帮助的，因为你要思考，要有个具体的框架，要去思考写啥，建博客对我更是一个挑战。 Q：为什么文章里这么多括号吐槽？ R：让你们感受下人格分裂，主要是一种风格吧，记得是从《肖申克的救赎》这本书里一个小章（并不是肖申克的救赎那篇）里有这种写法，当时觉得挺有意思，便逐渐运用起来了，希望你们能接受。（哈哈，你真的以为有人会来看吗？doge） Q：有目标吗？ R：当然……..莫了，尽力去做好眼前的事呗，然后尽量多去学点技术，丰富自己。 Q&amp;R：嗯嗯嗯，差不多了，我就不再表演了（真的！），下次有缘再见了，拜咪~！","categories":[{"name":"大学生活","slug":"大学生活","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E5%A4%A7%E5%AD%A6%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"小结","slug":"小结","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E5%B0%8F%E7%BB%93/"},{"name":"扯淡","slug":"扯淡","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E6%89%AF%E6%B7%A1/"}]},{"title":"Windows个性化使用指南","slug":"Windows个性化使用指南","date":"2021-04-24T01:52:00.000Z","updated":"2021-05-10T00:45:00.000Z","comments":true,"path":"2021/04/24/Windows个性化使用指南/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/04/24/Windows%E4%B8%AA%E6%80%A7%E5%8C%96%E4%BD%BF%E7%94%A8%E6%8C%87%E5%8D%97/","excerpt":"&emsp;&emsp;老早就想要写一篇文章分享下win10使用必备软件和一些个人认为有必要的美化了，最近忙里偷闲写出来了这篇文章。（话说这种东西为毛要放在博客里）小白向，带佬们请自行判断。你也可以前往这里自行探索，比我要专业的多。","text":"&emsp;&emsp;老早就想要写一篇文章分享下win10使用必备软件和一些个人认为有必要的美化了，最近忙里偷闲写出来了这篇文章。（话说这种东西为毛要放在博客里）小白向，带佬们请自行判断。你也可以前往这里自行探索，比我要专业的多。 背景&amp;说明&emsp;&emsp;个人算是个win的老用户了，XP、7、8、10都用过，现在已是win10的时代了，身边很多人对win的认知仍然停留在XP时代。我的感受就是身边的很多人会用电脑就是仅仅会”用”而已。完全做不到使用手机那种舒适和感觉。我本人看过许多的美化教程，尝试过挺多的软件，故纯主观地写这篇文章，以自己的方案做示例，将自身的使用经验分享给大家。希望能帮大家更加舒适地使用电脑。 美化之类的东西肯定会占用一部分电脑性能并且有一定风险，请事先做好备份工作，我本人的理念是简单舒适，并不追求深度的美化,一般来说，只要你在使用现代的电脑，那么基本不用担心性能问题 美化的尽头是原生是句名言，但是本人认为轻度的美化能带来巨大的感知提升，还是有必要的 改善外观 本部分来说一说纯美化的方面，有些是可选项，请根据自身情况判断（如果你实在不知道自己是否需要某种效果，可以先按部就班地来尝试一下） 准备工作 【基本】找一张喜欢/耐看的壁纸（应当基于屏幕的分辨率&lt;桌面右键-显示设置-显示分辨率&gt;） 【推荐】获取TranslucerTB（备用地址，也可以从Microsoft Store搜索获取&lt;建议那个汉化版本的&gt;，需要微软账号，需要打开Windows更新） 【推荐】7TSPGUI（此版本仅兼容Win10 1903/1909/2004/20H2需要.NET支持，如果打开后报错，请安装.NET3.5） 获取Rainmeter(即雨滴皮肤，默认官网，备用地址) 进阶玩法，更多 开始使用 请先自行安装好准备好的软件（Ps.如果你家C盘不是很大，请不要一股脑的装到C盘，即使很大也不推荐）。下面过程中会产生很多文件，请自行做好整理（憋像撒子一样全仍在桌面） 【基本】桌面右键-个性化-浏览-选择你准备好的壁纸 【推荐】打开TranslucerTB并设置开机启动然后配置各种状态下的效果 【推荐】7TSP可以更改系统默认图标(实际上只能替换部分，但效果还是很不错的请自行下载喜欢的图标包（请注意整体风格的搭配），可以来这里。 下载喜欢的雨滴皮肤（请注意整体风格的搭配），打开Rainmmeter。解压皮肤后双击即可安装，可以按照发布者的说明进行一些基础的调整（Rainmeter有很多高级玩法，有兴趣请自行探索）我需求比较简单。 【推荐】更改鼠标指针方案：可以来这里或者其他地方下载好文件，解压文件，打开文件夹，选中inf文件右键安装即可，一般会直接提示你右键安装。 在弹出的界面内选择想要的方案并应用即可（也可以从设置-设备-鼠标-其他鼠标选项-指针打开此界面；当然，你也可以从控制面板进行设置，会更方便一些）。 【附加】任务栏图标居中（如上图），个人推荐这种方法（请自行调整到合适的位置Ps.这并不是我的知乎账号），试过的一些软件都有图标闪烁等问题。 【附加】此项可用于配合Rainmeter使用。win10右下角系统图标都是可以关闭的（比如时钟、音量、网络），任务栏空白处右键-任务栏设置(T)-弹出下面界面-点击“打开或关闭系统图标”-自行更改即可。 实用工具 实用工具请根据自己需求选择，自行判断是否需要设为开机启动项（Ps.白教，任务栏空白处右键-任务管理器-启动-即可管理开机启动项&lt;也可以从安全软件中管理&gt;） QuickLook（空格键快速预览文件&lt;文件夹显示基本信息&gt;，有扩展插件，支持众多文件类型；同样微软商店也有，上面已说明要求） uTools（优秀的国产工具，我主要用于快速启动应用&lt;这样可以删掉桌面所有快捷方式图标&gt;和搜索，支持拼音和首字母，支持全局快捷键，有一大堆小插件，类似的软件有挺多的，个人推荐这个&gt;&gt;自行摸索，不会使用可以先阅读官方文档&lt;&lt;Ps.任何东西使用前先读一读readme总没坏处） 火绒安全软件（业界良心，如果你是老司机，裸奔也完全没问题，个人还是喜欢加个安全软件，弹窗拦截功能一定要加上，火绒十分安静&lt;你基本不会意识到它的存在&gt;） 右键颜色模式快捷键（大概是某位大佬做的小工具，在桌面右键快捷切换深色和浅色模式，按需选择即可） 更多（美化的道路永无止境，有兴趣请自行去探索） 附加说明 关于主题包：基本上算是深度的美化了，个人不推荐，别人整合的未必是你喜欢的，当然，你也可以从中借鉴一些东西。 关于动态壁纸：动态壁纸原理大概就是在桌面循环播放一个视频，相对算是比较占用资源的，其实也就图个新鲜感，我现在是没有兴趣去整了。你可以找WallpaperEngine（去创意工坊看看）、RainWallpaper，还有免费的Wallpaper Maker （造物主视频桌面）,and so on.链接都是Steam上的，不过其实就是个加载软件，最主要的应该是你要找到自己喜欢的素材。 个人以为，美化追求的应当是简洁高效舒适，过度的美化那就有点给别人看的意味了。我是以自己的使用作为例子，推荐完全主观，具体的实施交给你们，总之适合自己的才是最好的。","categories":[{"name":"技术分享","slug":"技术分享","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E6%8A%80%E6%9C%AF%E5%88%86%E4%BA%AB/"}],"tags":[{"name":"Windows","slug":"Windows","permalink":"https://wenewenew.gitee.io/wenewenew/tags/Windows/"},{"name":"教程","slug":"教程","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"随意写的阶段性小结","slug":"随意的阶段小结","date":"2021-04-17T01:52:00.000Z","updated":"2021-04-17T01:52:00.000Z","comments":false,"path":"2021/04/17/随意的阶段小结/","link":"","permalink":"https://wenewenew.gitee.io/wenewenew/2021/04/17/%E9%9A%8F%E6%84%8F%E7%9A%84%E9%98%B6%E6%AE%B5%E5%B0%8F%E7%BB%93/","excerpt":"简单说说&emsp;&emsp;有时候你不得不去感慨时间流逝得这么快（虽然明知道时间的速度不会变），似乎转眼间一天过去了、一周过去了、一年过去了、一生（这个还不至于doge） &emsp;&emsp;是啊，今天是四月十七日，这学期第七周周六，整个学期也大概18周（虽然标了20周），差不多过了一半了，总结下来学习上似乎还是没有什么起色，我依然是一个实实在在的懒癌晚期患者，每天手机使用时间至少6h,再加上打打电脑，在电子产品上花费的时间确实让人吃惊，那么从今天起，我要好好学习，早睡早起，少玩手机都拖延了这么多年，我很清楚自己，Flag是拯救不了我的，这就是心有余而力不足吧。但是，还是要去改变，绝大多数时候，改变是一个缓慢的过程，我要做的，就是逐渐改变自身态度，努力往更好的方向发展。","text":"简单说说&emsp;&emsp;有时候你不得不去感慨时间流逝得这么快（虽然明知道时间的速度不会变），似乎转眼间一天过去了、一周过去了、一年过去了、一生（这个还不至于doge） &emsp;&emsp;是啊，今天是四月十七日，这学期第七周周六，整个学期也大概18周（虽然标了20周），差不多过了一半了，总结下来学习上似乎还是没有什么起色，我依然是一个实实在在的懒癌晚期患者，每天手机使用时间至少6h,再加上打打电脑，在电子产品上花费的时间确实让人吃惊，那么从今天起，我要好好学习，早睡早起，少玩手机都拖延了这么多年，我很清楚自己，Flag是拯救不了我的，这就是心有余而力不足吧。但是，还是要去改变，绝大多数时候，改变是一个缓慢的过程，我要做的，就是逐渐改变自身态度，努力往更好的方向发展。 总结部分&emsp;&emsp;不知不觉地，我越来越喜欢总结自己的生活了。怎么说呢，相比去年，就目前来看自己是有进步的，可以体现于多个方面： 人际交往：明显要活跃很多，聊聊天什么的还是很开心的（这对我一个社恐来说真的很开心） 学校学习：在学习上我无法判断自己有多大变化，大概还是老样子 实际生活：最近看着路边随风飘动的树叶第一次感觉到生活的真实性，对，我感受到我实实在在地活在这世上（你也许无法理解这是什么意思，但我实际感受如此，以前从未感觉到自己这么实在地存在于这世上） 其他方面：我还是那么喜欢互联网带来的娱乐（这几个月搞的比较多的应该是：Bilibili，网易云，酷安，Twitter，Github，Telegram），不过最近看番比较多，也许后面会把看过的番总结下（正式加入二次元大家庭？！）[不过这是算进步吗doge] 重中之重：我说了自己有所改变，有所进步，其实最大的就是对待生活的态度，大概从高一开始，我变得特别的丧，对任何事物都打不起精神，人不能总是这么丧着，不知是受到什么影响，我意识到：低着头永远看不到前进的方向，抬起头才看得见前方的道路。 人生是一场喜剧，而喜剧的内核是悲剧，可我们作为喜剧演员还是要以乐观的态度来表演喜剧 ——WENEW 展望将来&emsp;&emsp;人要活在当下，过去的事终究是过去了，将来的事可以期待！ 短期目标 学习：这学期课程明显要比上学年难，没有长进，不付出更多努力的话，挂科是很有可能的，所以抓紧学习，上课要认真起来，多看看视频 其他： 一些其他短期小目标： 把《三体》三部曲读完，自第一部读完过了一年了，黑暗森林还没看完（ＭＤ，绝了）； 坚持背单词，做做真题。希望六月的四级能一次过，但要注意时间分配和取舍； 运营博客，周末或者闲时候来写写博，这个博客也是前前后后搞了挺久的，要让它发挥作用。 长期目标 学习一门计算机技术或者掌握软件使用，具体暂未决定：Python、HTML、java、PS、PR、AE、(SW)。 英语六级，这个我也挺想搞的，不知道实际价值如何，进一步了解后综合考量（先过了四级再说） 驾照，挺多舍友驾照都到手了，不出意外的话，暑假应该是在家考驾照（不过啥时候能用得上呢doge），尽量压缩下时间，去做点其他的事，当然也可以交叉进行。 向着更好的方向发展，以更乐观的态度对待生活，更好地活着！ 四字结语&emsp;&emsp;Flag年年有，我更希望自己能够切实努力实现一些目标，找到自己真正想去做的事，加油，愿年末再次写总结时，我能多打上几个对钩。 不乱于心，不困于情，不畏将来，不念过往，如此，安好。 ——丰子恺","categories":[{"name":"大学生活","slug":"大学生活","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E5%A4%A7%E5%AD%A6%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"小结","slug":"小结","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E5%B0%8F%E7%BB%93/"},{"name":"历程","slug":"历程","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E5%8E%86%E7%A8%8B/"}]}],"categories":[{"name":"技术分享","slug":"技术分享","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E6%8A%80%E6%9C%AF%E5%88%86%E4%BA%AB/"},{"name":"年更节目","slug":"年更节目","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E5%B9%B4%E6%9B%B4%E8%8A%82%E7%9B%AE/"},{"name":"经验之谈","slug":"经验之谈","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E7%BB%8F%E9%AA%8C%E4%B9%8B%E8%B0%88/"},{"name":"胡思乱想","slug":"胡思乱想","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E8%83%A1%E6%80%9D%E4%B9%B1%E6%83%B3/"},{"name":"大学生活","slug":"大学生活","permalink":"https://wenewenew.gitee.io/wenewenew/categories/%E5%A4%A7%E5%AD%A6%E7%94%9F%E6%B4%BB/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E6%95%99%E7%A8%8B/"},{"name":"MC","slug":"MC","permalink":"https://wenewenew.gitee.io/wenewenew/tags/MC/"},{"name":"小结","slug":"小结","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E5%B0%8F%E7%BB%93/"},{"name":"番剧","slug":"番剧","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E7%95%AA%E5%89%A7/"},{"name":"闲谈","slug":"闲谈","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E9%97%B2%E8%B0%88/"},{"name":"扯淡","slug":"扯淡","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E6%89%AF%E6%B7%A1/"},{"name":"Windows","slug":"Windows","permalink":"https://wenewenew.gitee.io/wenewenew/tags/Windows/"},{"name":"历程","slug":"历程","permalink":"https://wenewenew.gitee.io/wenewenew/tags/%E5%8E%86%E7%A8%8B/"}]}